# 자동 판매기를 시뮬레이션하는 프로그램을 작성하여 보자. 
# 사용자는 1000원짜리 지폐와 500원짜리 동전, 100원짜리 동전을 사용할 수 있다. 
# 물건값을 입력하고 1000원권, 500원짜리 동전, 100원짜리 동전의 개수를 입력하면 
# 거스름돈을 계산하여서 동전으로 반환한다. 



# 거스름돈(500원 동전 개수)을 계산한다. 

# 거스름돈(100원 동전 개수)을 계산한다. 

# 거스름돈(10원 동전 개수)을 계산한다. 

# 거스름돈(1원 동전 개수)을 계산한다. 

# 출력
물건값 = input("물건값을 입력하시오")

지불1000개수 = input("지불액1000개수")
지불1000개수 = int("지불액1000개수")

지불500개수 = input("지불액500개수")
지불500수 = int("지불액500개수")

지불100개수 = input("지불액100개수")
지불100수 = int("지불액100개수")\

지불액 = 지불1000개수 * 1000 +지불500개수 * 500 + 지불100개수 * 100

print(지불액)